[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "HTML Tutorial",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://play-lh.googleusercontent.com/e3mAZgd4sb9A_KPc2PFcFp-F4xdvHE3_A37Wt9H-OL-AlfUkCKiUc6ZlY0ru9lTBuw",
        "details": "HTML is the standard markup language for Web pages.With HTML you can create your own Website.HTML is easy to learn - You will enjoy it!"
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "What is CSS Framework",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://1.bp.blogspot.com/-qoRbqEk6fDA/X_q_nuttVOI/AAAAAAAAAW4/8KckJ-Y31sspJBoorrewI7GKDvsIChpJQCLcBGAsYHQ/s1200/css%2Bframework.png",
        "details": "A CSS framework is a prepped and ready-to-use CSS library (Cascading Style Sheets). The stylesheets collection makes the job of a UI developer easier.      Rather than starting every project from scratch, a CSS framework gives them tools to quickly create a user interface that they repeat and tweak during a project. They also enable the creation of more standards-compliant websites.    While quite challenging to use or ambiguous for beginners, senior developers who know the CSS framework sites’ descriptions and buzzwords find them extremely useful.  "
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71011",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.8,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "What is HTML",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
        "image_url": "https://www.freecodecamp.org/news/content/images/2021/08/html.png",
        "details": "The HyperText Markup Language or HTML is the standard markup language for documents designed to be displayed in a web browser. It can be assisted by technologies such as Cascading Style Sheets and scripting languages such as JavaScript."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71012",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.3,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "What is CSS",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
        "image_url": "https://www.oxfordwebstudio.com/user/pages/06.da-li-znate/sta-je-css/sta-je-css.png",
        "details": "CSS (Cascading Style Sheets) is the language used to describe the layout of websites. Although it is most commonly used in the development of web pages and user interfaces of online applications, any type of XML document can use CSS. In the beginning, this role was taken over by the very HTML. As sites have become increasingly complex, the code became highly unreadable and complicated for maintenance. Then it became clear that some new method must be introduced to solve this problem. The solution came in the mid-1990s in the form of CSS, then called CHSS. There are several versions of CSS. Each of them was upgraded to the previous one and provided new opportunities. So far, versions CSS1, CSS2, CSS3, and CSS4 have been released. Version CSS4 does not exist on its own, but there are a number of modules of the fourth level, so it is mentioned when speaking about CSS versions.The CSS code is in most cases found in a separate document that is then included where necessary. This is also the best method of working with CSS. It is also possible to use CSS directly in a document whose design is changed. This can be done in the header of the document, or in the tag of the element whose appearance is affected.Although the benefits of using CSS are not questionable, it also has a few limitations. Different Internet browsers interpret the code in different ways so it is necessary to use different methods to obtain consistency of appearance."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f9",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Bootstrap",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
        "image_url": "https://www.bootstrapdash.com/wp-content/uploads/2017/08/bootstrap-4-beta-whats-new.jpg",
        "details": "Bootstrap is a free, open source front-end development framework for the creation of websites and web apps. Designed to enable responsive development of mobile-first websites, Bootstrap provides a collection of syntax for template designs.   As a framework, Bootstrap includes the basics for responsive web development, so developers only need to insert the code into a pre-defined grid system. The Bootstrap framework is built on Hypertext Markup Language (HTML), cascading style sheets (CSS) and JavaScript. Web developers using Bootstrap can build websites much faster without spending time worrying about basic commands and functions."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f0",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Why Should We Learn HTML?",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
        "image_url": "https://codeinstitute.net/global/wp-content/uploads/sites/2/2020/02/blog_what_is_html.jpg",
        "details": "The internet has become a part of almost every aspect of our lives. We’ve watched it change purely text based websites to adding pictures, including videos and have attempted to make websites more interactive and aesthetically pleasing.Behind all websites and web-applications across sizes is a team of web designers and developers who are tasked with making sure that a website is both aesthetically appealing and functional. These days web-developers need to account for multiple factors when building websites, search engines and how websites are indexed, how the website needs to load on mobile devices and account for devices of different sizes when designing web-based experiences.Just like having the ability to speak a foreign language, equipping yourself with basic HTML and CSS skills are helpful in almost all professions. These powerful coding languages are not only helpful to web developers but in any professional setting, basic knowledge of these languages could make a huge difference to you and your resume. "
    },
    {
        "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": null,
        "title": "CSS TUTORIAL",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 15:00:04",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
        "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20210203171024/CSSTutorial.png",
        "details": "This course breaks down the fundamentals of CSS into digestible, easy to understand pieces. Over the next few modules, you'll learn how the core aspects of CSS work and how to use them effectively in your projects. Use the menu pane by the logo to navigate the modules.You'll learn CSS fundamentals like the box model, cascade and specificity, flexbox, grid and z-index. And, along with these fundamentals, you'll learn about functions, color types, gradients, logical properties and inheritance to make you a well-rounded front-end developer, ready to take on any user interface.Each module is full of interactive demos and self-assessments for you to test your knowledge. In addition to learning through reading and demos, there is an accompanying podcast episode for each topic as another way to learn and continue expanding your knowledge."
    },
    {
        "_id": "a713ee936ff5574273f0f769f5c5b20e",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 111,
        "title": "Foundation",
        "author": {
            "name": "MH Tonmoy",
            "published_date": null,
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
        "image_url": "https://zurb-dot-com-prod.s3.amazonaws.com/asset/1619/raw_2Fe1453eec-3b2b-4503-a7f8-29a36e43b38e_2Fadv-foundation.png",
        "details": "The Foundation framework is a front-end framework that integrates the classic Web design languages HTML and Cascading Style Sheets (CSS) with other tools and controls to provide a responsive environment for design. This open-source technology is maintained by ZURB since its development several years ago; several subsequent versions were released in 2011, 2012, 2013 and 2014 and another one planned for 2015.      Techopedia Explains Fou"
    },
    {
        "_id": "cd2b53655737cc4077542baea9f8f75d",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 700,
        "title": "10 min CSS Project",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 20:02:52",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20200121234029/Top-10-Projects-For-Beginners-To-Practice-HTML-and-CSS-Skills.jpg",
        "details": "Learning to code is always exciting and fun for everyone and when it comes to stepping into the programming world most of the people start with the easiest thing HTML and CSS. Every beginner’s coding journey in frontend starts with these two basic building blocks and you need to be creative when it comes to designing a beautiful application. Initially, beginners enjoy making buttons, adding the links, adding images, working with layout and a lot of cool stuff in web designing but when it comes to making a project using only HTML and CSS they get stuck and confuse about what they should make to practice all these stuff. Afterall their knowledge is just limited to HTML and CSS. No matter what after learning everything at some point you will realize that making a project is important to practice HTML and CSS skills. You need to check how HTML and CSS work together to design a beautiful frontend application. So the question is what are some beginner-friendly projects you can build to practice everything you have learned…Let’s discuss that. "
    },
    {
        "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "07",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 300,
        "title": "Firebase",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-24 22:30:00",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://i.ytimg.com/vi/fgT6r4f9Apc/maxresdefault.jpg",
        "details": "It seems like there’s an app for everything these days. Well, almost everything. I haven’t found an app that helps me remove impacted earwax. It happens to me sometimes, and it’s super obnoxious. But someone could build it! I’ll contribute to your Kickstarter.      If you’re the enterprising sort of person that tackles humanity’s urgent needs with a mobile app, you’ll want to know about Firebase. Firebase is Google’s mobile application development platform that helps you build, improve, and grow your app."
    },
    {
        "_id": "7c4dfea0fafddc813673282a428429b7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 0,
        "title": "HTML Basics to Learn HTML for Web Development",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-25 03:09:16",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://lenadesign.org/wp-content/uploads/2019/12/html-basic.jpg",
        "details": "Welcome to HTML Tutorial by DataFlair!!! HTML is the mark-up language most websites are written in. In this article, we will delve into the most basics of HTML  like tags and elements that are of utmost importance while writing any code in HTML. These tags help in the structuring and display of content on the web pages. So let’s start!!!"
    },
    {
        "_id": "30af81e91ab3eafc0bcae0de62f55d5c",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 320,
        "title": "Difference Between HTML and HTML5",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-25 07:35:11",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
        "image_url": "https://www.interviewbit.com/blog/wp-content/uploads/2021/09/Difference-Between-HTML-and-HTML5.jpg",
        "details": "As we know, there are a large number of languages, tools, and technologies that you can use to create a website, but HTML is one that is common to almost all websites and is one of those languages that is easier to learn and understand. HTML is short for Hypertext Markup Language. Besides providing the basic structure for all websites, HTML is also the most widely used programming language for developing web applications or websites. The latest version of HTML is HTML5 which allows better management of web applications and websites. HTML5 allows programs to incorporate any type of data, including video and audio data, while HTML5 does not support such data.Thus before going into the differences between HTML and HTML5, we will first understand what markup language is, then we will talk about what HTML and HTML5 are. Next, we will discuss HTML vs HTML5, how they differ, their features, which one to choose, and their advantages and disadvantages. By the end of this article, you will be able to answer these questions easily and have a clear understanding of the topic as a whole."
    },
    {
        "_id": "df11ff9feefc37613cc3a4486ce02151",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 552,
        "title": "10 Best Practices for Improving Your CSS",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-27 05:38:02",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
        "image_url": "https://images.viblo.asia/61acab5b-2e62-43e9-9617-525bdddb8d54.png",
        "details": "CSS seems like a fairly simple language, on which it is difficult to make mistakes. You just need to add your rules to style your website and you’re done, right? For small websites that only require a few CSS files, this may be the case. But in large applications, types can quickly get out of control. How do you keep them manageable? The fact is, like any other language, CSS has its own nuances that can create or break your design. Here are 10 tips for CSS – best practices that can help you bring out the best from your style."
    },
    {
        "_id": "919db97c34e0778b387dd40cdfa08130",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 89,
        "title": "HTML Projects with Source Code",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 18:05:42",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
        "image_url": "https://techgeekbuzz.com/media/post_images/uploads/2022/02/HTML-Projects.jpg",
        "details": "To become a proficient web developer, you need to learn and master three web development technologies, namely HTMLCSS, and JavaScript. While HTML is what allows you to create the structure of a web page, with CSS, you can style the web page and its elements. Also, you need to use JavaScript to add dynamic behavior to your web pages.In this article, we are going to discuss some popular HTML projects that will aid your learning and help you strengthen your knowledge of HTML. Also, we have divided these HTML projects on the basis of experience level so that you can easily pick ones that can help you to upskill."
    },
    {
        "_id": "374df11ae3d9b8b9ce21f4dc53f59b85",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 798,
        "title": "HTML Interview Questions",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-25 18:45:00",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
        "image_url": "https://hackr.io/blog/html-interview-questions/thumbnail/medium",
        "details": "Before starting with the interview questions on HTML Language, let’s first go through HTML, what is HTML, the career opportunities it provides, etc.  HTML stands for HyperText Markup language. It is a standard text formatting language used for developing web pages released in 1993. HTML is a language that is interpreted by the browser and it tells the browser what to display and how to display. HTML is an important language to learn if anyone wants to work in the web development domain [Web designers, Web Developers]. HTML alone is not sufficient for a web developer because HTML only defines the structure of the data that will be rendered on the browser in a webpage, to make it visually appealing and to make it functional, we will need to use CSS and Javascript respectively. The latest version of HTML is HTML5. There are two main components in HTML language, Tags and Attributes. The below image shows some basic HTML tags and attributes."
    },
    {
        "_id": "acb9b6785b62698fc6130db7615965e1",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 879,
        "title": "TailwindCSS",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-25 11:53:13",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
        "image_url": "https://res.cloudinary.com/practicaldev/image/fetch/s--KVRNbG6i--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/i/3jniane10gaa5osr6xjx.png",
        "details": "Writing CSS can be really difficult. Period. And I get it – it can be frustrating to nail down your own ideas or the designs you get from your design team.    I'm sure many of you have gone through the same pain at least a few times in your development careers.      Well not anymore. Because it's time to learn an interesting tool that takes away a lot of the burden from us. And no it's not Bootstrap – it's called Tailwind CSS.    While Tailwind has been around for a while now, you may not have come across it yet. Perhaps you just haven't heard about it, or you don't really know whether learning a new piece of tech related to CSS will really make your life easier."
    },
    {
        "_id": "1b03149c50f1bec662062d930bf46489",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 546,
        "title": "DO You Really Need a Framework?",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-30 22:00:00",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://res.cloudinary.com/practicaldev/image/fetch/s--6FXVQzdg--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/i/wjzvllxpohjwlk9z58v0.jpg",
        "details": "The whole myth that CSS is difficult to learn is mostly a relic of the times when browsers were not fully standardized and we had to use quirks, hacks, and workarounds to make things work. Over the last decade, the situation has improved a lot; CSS is much more consistent and has wide support for a lot of useful features which make those hacks unnecessary. It’s definitely not perfect (hello, Safari), but it’s manageable.Some people argue that CSS is difficult because it has become too complex and bloated. “Should I use flex or grid layout? Whatever, I’ll just use this framework and it will solve the problem.” So they end up learning the framework and its naming conventions, full of cryptic abbreviations, such as px-lg-n5, while they might just learn to use the right CSS properties instead.       Yes, CSS is complex, because over the years it has become a powerful and universal tool. In order to use a tool efficiently, you have to learn how it works. Unfortunately, CSS frameworks have the opposite effect — they teach us to copy and paste snippets of markup instead of actually understanding what’s going on."
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f0",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "05",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "React JS",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/L507x2V/unsplash-Eh-Tc-C9s-YXsw-14.png",
        "image_url": "https://miro.medium.com/max/1400/1*CeuWv9fCjD1uTiTuKytnBQ.png",
        "details": "When I started out with JavaScript, I built some beginner projects with vanilla JavaScript, when it was time to work on a real life project, I had to work with React, which is a JavaScript library . With React, I didn’t have to write from scratch when developing the product.     In the JavaScript ecosystem, there are quite a number of frameworks/libraries for building user interfaces(UIs). React is the most commonly used library, others include Vue and Angular."
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "DOM ( Document Object Model )",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
        "image_url": "https://desarrolloweb.com/media/264/dom.jpg",
        "details": "DOM stands for Document Object Model, and it’s the data representation of a web document, such as an HTML page, an SVG graphic, or an XML file.In very plain English, the DOM is a bunch of objects (Document Object Model) that make up a web page. Each object is the real-world implementation of an interface — the blueprint that describes what an object should look like. Thus, one interface can be implemented by multiple objects.      For example, each HTML <form> element is represented by a HTMLFormElement object in the DOM, which is an implementation of the HTMLFormElement interface. This interface comes with pre-written properties (interface variables) and methods (interface functions) that you can use to add dynamic functionality to each form object (that appears as a <form> tag in the HTML document). For example, you can use HTMLFormElement.reset() method to reset a form to its initial state."
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "08",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "Database",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
        "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20201223192017/How-to-Choose-The-Right-Database-for-Your-Application.png",
        "details": "“I’ll just choose X, it’s the DB I know and worked with”.  Most of the developers and students use this statement when it comes to choosing a database for a project. Working with a database you’re already familiar with is perfectly fine if performance is not an important requirement for your system, but consider a situation when your application grows and after a couple of years your app starts facing some issues. It will become a headache for developers and administrators to fix the issue. It doesn’t matter you are working on a project from scratch or you’re already working on a mature project, it’s important to know the limitations of the database and identify when to add another type of DB in your project. There are more than 300 database management systems available in the market and choosing the one can be overwhelming for developers. You have a variety of options available in relational (MySQL, PostgreSQL, Oracle DB, etc) and non-relational (MongoDB, Apache HBase, Cassandra, etc) database but you need to understand none of them fits on all kinds of projects requirement. Each one of them has some strengths and weaknesses. Let’s look at some case study that illustrates how you should choose the right database for your application. "
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "08",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "Database Mong0-DB",
        "author": {
            "name": "MH Tonmoy",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://i.pinimg.com/originals/09/24/a7/0924a7ef295741e916c8f42512bbe5bd.jpg"
        },
        "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
        "image_url": "https://www.opc-router.com/wp-content/uploads/2021/04/mongoDB_socialmedia_en.jpg",
        "details": "What is MongoDB? MongoDB is a database based on a non-relational document model. Thus, as a so-called NoSQL database (NoSQL = Not-only-SQL), it differs fundamentally from conventional relational databases such as Oracle, MySQL or the Microsoft SQL Server. The name MongoDB is derived from the English word “humongous”, which roughly means “gigantic”. MongoDB was released in 2009 by founder and developer Eliot Horowitz, who stepped down as Chief Technology Officer and from the Board of Directors of MongoDB Inc. in 2020, but is still active as a technical consultant.    You can find a special video with the caption “connection of database systems” on this topic in our tutorial stream."
    }
]